Tekla.Structures.Drawing.TagLocation
The mark tag location values.

Tekla.Structures.Drawing.TagLocation.AboveLine
The mark tag is above the line.

Tekla.Structures.Drawing.TagLocation.BelowLine
The mark tag is below the line.

Tekla.Structures.Drawing.TagLocation.MiddleLevelOfSymbol
The mark tag is in the middle level of the mark symbol.

Tekla.Structures.Drawing.TagLocation.AboveSymbolCenterLine
The mark tag is above the center line of the mark symbol.

Tekla.Structures.Drawing.TagLocation.BelowSymbolCenterLine
The mark tag is below the center line of the mark symbol.

Tekla.Structures.Drawing.TagLocation.CustomRelativeToSymbol
The mark tag is in a custom location relative to the mark symbol.